# Exercício 1

```cisco
Switch1> enable                                      
Switch1# configure terminal                          

Switch1(config)# vlan 1                              
Switch1(config-vlan)# name Professores               
Switch1(config-vlan)# exit                           

Switch1(config)# vlan 2                              
Switch1(config-vlan)# name Alunos                    
Switch1(config-vlan)# exit                           

Switch1(config)# interface range Fa0/1-2             
Switch1(config-if-range)# switchport mode access     
Switch1(config-if-range)# switchport access vlan 1   
Switch1(config-if-range)# exit                       

Switch1(config)# interface range Fa0/3-4             
Switch1(config-if-range)# switchport mode access     
Switch1(config-if-range)# switchport access vlan 2   
Switch1(config-if-range)# exit                       
                                    
Switch1# write memory     
```                             

# Exercício 2c

## Configuração do Switch 1
```cisco
Switch1> enable
Switch1# configure terminal

Switch1(config)# vlan 1                              
Switch1(config-vlan)# name Professores               
Switch1(config-vlan)# exit                           

Switch1(config)# vlan 2                              
Switch1(config-vlan)# name Alunos                    
Switch1(config-vlan)# exit                           

Switch1(config)# interface range Fa0/1-2             
Switch1(config-if-range)# switchport mode access     
Switch1(config-if-range)# switchport access vlan 1   
Switch1(config-if-range)# exit                       

Switch1(config)# interface range Fa0/3-4             
Switch1(config-if-range)# switchport mode access     
Switch1(config-if-range)# switchport access vlan 2   
Switch1(config-if-range)# exit  

Switch1(config)# interface Fa0/24                       
Switch1(config-if)# switchport mode trunk               
Switch1(config-if)# switchport trunk allowed vlan 1,2   
Switch1(config-if)# exit                      

Switch1# write memory                                   
```

## Configuração do Switch 2
```cisco
Switch2> enable
Switch2# configure terminal

Switch2(config)# vlan 1                                 
Switch2(config-vlan)# name Professores                  
Switch2(config-vlan)# exit

Switch2(config)# vlan 2                                
Switch2(config-vlan)# name Alunos                       
Switch2(config-vlan)# exit

Switch2(config)# interface range Fa0/1-2                
Switch2(config-if-range)# switchport mode access        
Switch2(config-if-range)# switchport access vlan 1      
Switch2(config-if-range)# exit

Switch2(config)# interface range Fa0/3-4                
Switch2(config-if-range)# switchport mode access        
Switch2(config-if-range)# switchport access vlan 2      
Switch2(config-if-range)# exit

Switch2(config)# interface Fa0/24                       
Switch2(config-if)# switchport mode trunk               
Switch2(config-if)# switchport trunk allowed vlan 1,2   
Switch2(config-if)# exit

Switch2# write memory                                  
```

# Exercício 2d

## Configuração do Roteador

```cisco
Router1> enable                                                 
Router1# configure terminal                                     

Router1(config)# interface GigabitEthernet0/0.1                
Router1(config-subif)# encapsulation dot1Q 1                   
Router1(config-subif)# ip address 192.168.1.1 255.255.255.0    
Router1(config-subif)# exit

Router1(config)# interface GigabitEthernet0/0.2                
Router1(config-subif)# encapsulation dot1Q 2                    
Router1(config-subif)# ip address 192.168.2.1 255.255.255.0    
Router1(config-subif)# exit

Router1(config)# interface GigabitEthernet0/0                  
Router1(config-if)# no shutdown                                
Router1(config-if)# exit

Router1# write memory                              
```